
#### environment: dev
#### Terraform fmt check `success`
#### Terraform init `success`
#### Terraform validate `success`
#### Terraform plan `success`
<details>
  <summary>Show Plan</summary>
  
  ```
    module.root.google_service_account.github_actions_read_write_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_service.resource_manager: Refreshing state... [id=company-official-app-dev/cloudresourcemanager.googleapis.com]
module.root.google_project_service.iam: Refreshing state... [id=company-official-app-dev/iam.googleapis.com]
module.root.google_service_account.backend_api: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/backend-api@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_service.service_networking: Refreshing state... [id=company-official-app-dev/servicenetworking.googleapis.com]
module.root.google_project_service.secret_manager: Refreshing state... [id=company-official-app-dev/secretmanager.googleapis.com]
module.root.google_compute_network.private_network: Refreshing state... [id=projects/company-official-app-dev/global/networks/private-network]
module.root.google_service_account.github_actions_read_only_service_account: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_service.service_usage: Refreshing state... [id=company-official-app-dev/serviceusage.googleapis.com]
module.root.google_project_iam_custom_role.github_actions_read_write_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_write_role]
module.root.google_storage_bucket.manage_tfstate: Refreshing state... [id=tfstate-coa-dev]
module.root.google_service_account.github_actions_mysql_client: Refreshing state... [id=projects/company-official-app-dev/serviceAccounts/github-actions-mysql-client@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_custom_role.github_actions_read_only_role: Refreshing state... [id=projects/company-official-app-dev/roles/github_actions_read_only_role]
module.root.google_project_service.cloud_run: Refreshing state... [id=company-official-app-dev/run.googleapis.com]
module.root.google_project_service.cloud_sql_admin: Refreshing state... [id=company-official-app-dev/sqladmin.googleapis.com]
module.root.google_project_iam_custom_role.backend_api: Refreshing state... [id=projects/company-official-app-dev/roles/backend_api_role]
module.root.google_project_iam_member.github_actions_mysql_client: Refreshing state... [id=company-official-app-dev/roles/cloudsql.client/serviceAccount:github-actions-mysql-client@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_compute_global_address.private_ip_address: Refreshing state... [id=projects/company-official-app-dev/global/addresses/private-ip-address]
module.root.google_project_iam_member.github_actions_read_write_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_write_role/serviceAccount:github-actions-read-write@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_member.github_actions_read_only_iam: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/github_actions_read_only_role/serviceAccount:github-actions-read-only@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_project_iam_member.backend_api: Refreshing state... [id=company-official-app-dev/projects/company-official-app-dev/roles/backend_api_role/serviceAccount:backend-api@company-official-app-dev.iam.gserviceaccount.com]
module.root.google_service_networking_connection.private_connection: Refreshing state... [id=projects%2Fcompany-official-app-dev%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
google_sql_database_instance.app_mysql_instance: Refreshing state... [id=app-mysql-01]
module.root.google_sql_database.app_mysql_database: Refreshing state... [id=projects/company-official-app-dev/instances/app-mysql-01/databases/app-mysql-database]
module.root.google_cloud_run_service.company_official_app_backend: Refreshing state... [id=locations/asia-northeast1/namespaces/company-official-app-dev/services/company-official-app-backend-dev]
module.root.google_sql_user.app_mysql_root_user: Refreshing state... [id=root//app-mysql-01]
module.root.google_sql_user.app_mysql_migration_ro_user: Refreshing state... [id=migration_ro//app-mysql-01]
module.root.google_sql_user.app_mysql_user: Refreshing state... [id=app//app-mysql-01]
module.root.google_cloud_run_service_iam_member.backend_api_noauth: Refreshing state... [id=v1/projects/company-official-app-dev/locations/asia-northeast1/services/company-official-app-backend-dev/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.root.google_cloud_run_service.company_official_app_backend will be updated in-place
  ~ resource "google_cloud_run_service" "company_official_app_backend" {
        id                         = "locations/asia-northeast1/namespaces/company-official-app-dev/services/company-official-app-backend-dev"
        name                       = "company-official-app-backend-dev"
        # (4 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "asia.gcr.io/company-official-app-dev/company-official-app-backend:8345cb6b806dbdd97a041a56e76d87a3ec46a708" -> "asia.gcr.io/company-official-app-dev/company-official-app-backend:5f7842bfe516574430dedef40003c80aac50a42a"
                    # (2 unchanged attributes hidden)



                    # (9 unchanged blocks hidden)
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.root.google_project_iam_member.firebase_hosting_admin will be created
  + resource "google_project_iam_member" "firebase_hosting_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "company-official-app-dev"
      + role    = "roles/firebasehosting.admin"
    }

  # module.root.google_project_iam_member.firebase_hosting_api_keys_viewer will be created
  + resource "google_project_iam_member" "firebase_hosting_api_keys_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "company-official-app-dev"
      + role    = "roles/serviceusage.apiKeysViewer"
    }

  # module.root.google_service_account.firebase_hosting will be created
  + resource "google_service_account" "firebase_hosting" {
      + account_id   = "firebase-hosting"
      + description  = "フロントエンドサービスをfirebase hostingでデプロイする用"
      + display_name = "firebase-hosting"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

    
  ```

</details>